In [1]:
import pandas as pd

#Q1ANSWER

In [57]:
df=pd.Series([4,8,15,16,23,42])

In [58]:
df

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [59]:
type(df)

pandas.core.series.Series

In [60]:
for i in df:
    print(i)

4
8
15
16
23
42

#Q2 ANSWER

In [61]:
a=list(range(10))

In [62]:
df=pd.Series(a)

In [63]:
for i in df:
    print(i)

0
1
2
3
4
5
6
7
8
9

   #Q3 ANSWER

In [64]:
d={
    "Name":["Alice","Bob","Claire"],
    "Age":[25,30,27],
    "Gender":["Female","Male","Female"]
}

In [65]:
df=pd.DataFrame(d)

In [66]:
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

#Q4 ANSWER

Pandas provide two data structures that shape data into a readable form:

Series

DataFrame

#Series
A pandas series is a one-dimensional data structure that comprises of key-value pair, where keys/labels are the indices and values are the values stored on that index. It is similar to a python dictionary, except it provides more freedom to manipulate and edit the data.

We use pandas.Series()to initialize a series object using Pandas.

In [17]:
a=[1,2,3,4,5]
s=pd.Series(a)

here we have not specified our own index so it will set the default indices

In [18]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

keys are the indices 0,,1,2,3,4

values are the values in the list 1,2,3,4,5

In [19]:
s=pd.Series(a,index=["a","b","c","d","e"])

here we have settinf our own indices

In [20]:
s

a    1
b    2
c    3
d    4
e    5
dtype: int64

keys are the indices specified by us a,b,c,d,e

values are the values in the list

In [21]:
type(s)

pandas.core.series.Series

In [22]:
fruits=["apple","guava","banana","pineapple"]
allfruits=pd.Series(fruits,index=[4,3,2,1],name="fruitswallah")

here we have specified the name of the series fruitswallah

In [24]:
allfruits

4        apple
3        guava
2       banana
1    pineapple
Name: fruitswallah, dtype: object

In [25]:
d={"a":25,"bb":30,"c":50,"za":21,2:100}

series can ber initalise inthe form of dictionary also

where the index are the keyalues of dictionary and values are values of the keys

In [26]:
data=pd.Series(d)

In [27]:
data

a      25
bb     30
c      50
za     21
2     100
dtype: int64

In [28]:
data.iloc[1]

30

data can be with drawn by entering default indices

In [29]:
data.loc["a"]

25

data is withdrawn by entering the specified indices

In [31]:
data["a"]

25

In [32]:
allfruits

4        apple
3        guava
2       banana
1    pineapple
Name: fruitswallah, dtype: object

In [33]:
allfruits.loc[4]#specified index

'apple'

In [34]:
allfruits.iloc[0]#default index

'apple'

In [35]:
allfruits[1]#specified index

'pineapple'

# Dataframe

A pandas DataFrame is a two-dimensional data structure that can be thought of as a spreadsheet. It can also be thought of as a collection of two or more series with common indices.

In [36]:
allfruits={
    "jackfruits":["apple","guava","banana"],
    "johnfruits":["kiwis","oranges","strawberries"]
}

In [37]:
df=pd.DataFrame(allfruits)

In [38]:
df

  jackfruits    johnfruits
0      apple         kiwis
1      guava       oranges
2     banana  strawberries

In [39]:
df=pd.DataFrame(allfruits,index=["a","b","c"])

In [40]:
df

  jackfruits    johnfruits
a      apple         kiwis
b      guava       oranges
c     banana  strawberries

In [41]:
df["jackfruits"]

a     apple
b     guava
c    banana
Name: jackfruits, dtype: object

In [42]:
df["johnfruits"]

a           kiwis
b         oranges
c    strawberries
Name: johnfruits, dtype: object

In [43]:
df.iloc[0]

jackfruits    apple
johnfruits    kiwis
Name: a, dtype: object

In [44]:
df.loc["a"]

jackfruits    apple
johnfruits    kiwis
Name: a, dtype: object

In the code example above, a DataFrame is initialized using a dictionary with two key-value pairs. Every key in this dictionary represents a column in the resulting DataFrame and the value represents all the elements in this column.

Both of the lists comprising of fruits as values are used to make a Python dictionary which is then passed to the pandas.DataFrame() method to make a DataFrame.

#Q5 ANSWER

1. pd.read_csv, pd.read_excel

The first function to mention is read_csv or read_excel

In [45]:
df=pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [46]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

2. df.columns

When you have a big dataset like that it can be hard to see all the columns. using .columns function, you can print out all the columns of the dataset:

In [47]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

3. df.drop()

You can drop some unnecessary columns using df.drop(). In this dataset we have so many columns we are not going to use all of themm for this tutorial. So, we can easily drop some:

In [48]:
df.drop("SibSp",axis=1) #SibSp colum has been deleted

,PassengerId,Survived,Pclass,Name,Sex,Age,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,370376,7.7500,NaN,Q

4. .len()
Provides with the length of the DataFrame.

In [49]:
len(df)

891

5df.iloc()

This function takes as a parameter the rows and column indices and gives you the subset of the

In [50]:
df.iloc[5:10,1:4] # first rows indices then column indices

   Survived  Pclass                                               Name
5         0       3                                   Moran, Mr. James
6         0       1                            McCarthy, Mr. Timothy J
7         0       3                     Palsson, Master. Gosta Leonard
8         1       3  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
9         1       2                Nasser, Mrs. Nicholas (Adele Achem)

 6df[‘’].dtypes
 
Another very basic and widely used functions. Because it is necessary to know the data types of the variables before we dive into the analysis, visualization, or predictive modeling.

In [51]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

#Q6 ANSWER

   A Series is a one dimensional array like structure with homogeneous data. The values of the series are mutable means we can change any value in series, but the size of the series is immutable so we can not change the size of the series. A series can hold any type of data like integer, decimal, string, python objects, etc
   
DataFrame is a two-dimensional array with heterogeneous data. A DataFrame size is mutable and data is also mutable so we can change the data and size of DataFrame at any time.

The panel is a three-dimensional data structure with heterogeneous data. It is very hard to represent the Panel in a graphical representation. But a Panel can be illustrated as a container of a DataFrame. In Panel Data and size are mutable

#Q7 ANSWERS

In [71]:
series1=pd.Series([1,2,3,4,5,6,7])
series2=pd.Series([11,12,13,14,15,16,17])
series3=pd.Series([21,22,23,24,25,26,27])

here i have created 3 series

In [72]:
d={"col1":series1,
  "col2":series2,
  "col3":series3}

here i have made dictionary of series where key wil take the column name and value will take the values of the keys

In [73]:
df=pd.DataFrame(d)

In [74]:
df

   col1  col2  col3
0     1    11    21
1     2    12    22
2     3    13    23
3     4    14    24
4     5    15    25
5     6    16    26
6     7    17    27